; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=402, out_folder=./training, instance_id=94, seed=2118, goal_proportion=0.03

(define (problem blocksworld-94)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 b370 b371 b372 b373 b374 b375 b376 b377 b378 b379 b380 b381 b382 b383 b384 b385 b386 b387 b388 b389 b390 b391 b392 b393 b394 b395 b396 b397 b398 b399 b400 b401 b402 - object)
 (:init 
    (arm-empty)
    (clear b248)
    (on b248 b301)
    (on b301 b292)
    (on b292 b84)
    (on b84 b273)
    (on b273 b288)
    (on b288 b19)
    (on b19 b375)
    (on b375 b222)
    (on b222 b15)
    (on-table b15)
    (clear b68)
    (on b68 b387)
    (on b387 b140)
    (on b140 b159)
    (on b159 b372)
    (on b372 b340)
    (on b340 b85)
    (on b85 b264)
    (on b264 b304)
    (on b304 b287)
    (on b287 b148)
    (on-table b148)
    (clear b216)
    (on b216 b302)
    (on b302 b26)
    (on b26 b211)
    (on-table b211)
    (clear b389)
    (on b389 b124)
    (on-table b124)
    (clear b386)
    (on b386 b115)
    (on-table b115)
    (clear b323)
    (on b323 b245)
    (on b245 b158)
    (on b158 b36)
    (on-table b36)
    (clear b224)
    (on-table b224)
    (clear b89)
    (on-table b89)
    (clear b284)
    (on b284 b32)
    (on b32 b308)
    (on-table b308)
    (clear b152)
    (on b152 b11)
    (on-table b11)
    (clear b242)
    (on b242 b352)
    (on b352 b27)
    (on-table b27)
    (clear b119)
    (on b119 b358)
    (on b358 b378)
    (on-table b378)
    (clear b25)
    (on b25 b190)
    (on b190 b160)
    (on b160 b194)
    (on b194 b208)
    (on b208 b173)
    (on-table b173)
    (clear b324)
    (on b324 b310)
    (on b310 b126)
    (on b126 b104)
    (on b104 b70)
    (on b70 b199)
    (on-table b199)
    (clear b392)
    (on-table b392)
    (clear b62)
    (on b62 b274)
    (on-table b274)
    (clear b214)
    (on-table b214)
    (clear b179)
    (on b179 b315)
    (on-table b315)
    (clear b362)
    (on b362 b298)
    (on-table b298)
    (clear b35)
    (on b35 b246)
    (on b246 b303)
    (on b303 b337)
    (on b337 b156)
    (on b156 b212)
    (on-table b212)
    (clear b276)
    (on b276 b193)
    (on b193 b69)
    (on-table b69)
    (clear b218)
    (on b218 b56)
    (on b56 b168)
    (on b168 b171)
    (on b171 b268)
    (on b268 b373)
    (on b373 b169)
    (on b169 b397)
    (on b397 b291)
    (on-table b291)
    (clear b8)
    (on-table b8)
    (clear b259)
    (on b259 b263)
    (on-table b263)
    (clear b47)
    (on b47 b299)
    (on-table b299)
    (clear b28)
    (on b28 b125)
    (on b125 b262)
    (on b262 b137)
    (on b137 b117)
    (on-table b117)
    (clear b133)
    (on-table b133)
    (clear b391)
    (on-table b391)
    (clear b217)
    (on-table b217)
    (clear b357)
    (on b357 b339)
    (on-table b339)
    (clear b250)
    (on b250 b186)
    (on b186 b336)
    (on b336 b265)
    (on b265 b347)
    (on b347 b345)
    (on b345 b6)
    (on b6 b277)
    (on-table b277)
    (clear b188)
    (on-table b188)
    (clear b338)
    (on b338 b141)
    (on b141 b135)
    (on b135 b54)
    (on b54 b346)
    (on b346 b200)
    (on b200 b260)
    (on b260 b155)
    (on-table b155)
    (clear b311)
    (on b311 b80)
    (on b80 b377)
    (on b377 b131)
    (on b131 b383)
    (on b383 b55)
    (on b55 b363)
    (on b363 b63)
    (on b63 b167)
    (on-table b167)
    (clear b223)
    (on b223 b290)
    (on b290 b379)
    (on b379 b162)
    (on b162 b210)
    (on-table b210)
    (clear b31)
    (on b31 b38)
    (on b38 b270)
    (on b270 b266)
    (on b266 b305)
    (on b305 b300)
    (on-table b300)
    (clear b123)
    (on b123 b83)
    (on b83 b228)
    (on b228 b172)
    (on b172 b271)
    (on b271 b321)
    (on b321 b313)
    (on b313 b2)
    (on b2 b113)
    (on b113 b196)
    (on b196 b150)
    (on-table b150)
    (clear b374)
    (on-table b374)
    (clear b316)
    (on b316 b335)
    (on b335 b239)
    (on b239 b380)
    (on-table b380)
    (clear b58)
    (on b58 b34)
    (on b34 b136)
    (on b136 b289)
    (on b289 b318)
    (on b318 b258)
    (on-table b258)
    (clear b92)
    (on b92 b13)
    (on b13 b219)
    (on b219 b342)
    (on b342 b281)
    (on-table b281)
    (clear b48)
    (on-table b48)
    (clear b101)
    (on b101 b51)
    (on-table b51)
    (clear b46)
    (on b46 b279)
    (on-table b279)
    (clear b240)
    (on b240 b72)
    (on b72 b138)
    (on b138 b198)
    (on b198 b306)
    (on b306 b132)
    (on-table b132)
    (clear b97)
    (on b97 b354)
    (on-table b354)
    (clear b192)
    (on b192 b29)
    (on b29 b170)
    (on-table b170)
    (clear b390)
    (on b390 b395)
    (on-table b395)
    (clear b144)
    (on b144 b3)
    (on b3 b121)
    (on b121 b244)
    (on b244 b368)
    (on b368 b109)
    (on b109 b24)
    (on-table b24)
    (clear b76)
    (on b76 b206)
    (on-table b206)
    (clear b61)
    (on b61 b30)
    (on b30 b164)
    (on b164 b111)
    (on b111 b16)
    (on b16 b86)
    (on-table b86)
    (clear b385)
    (on b385 b371)
    (on-table b371)
    (clear b350)
    (on-table b350)
    (clear b106)
    (on b106 b332)
    (on b332 b17)
    (on-table b17)
    (clear b191)
    (on b191 b165)
    (on b165 b10)
    (on b10 b45)
    (on b45 b326)
    (on b326 b50)
    (on-table b50)
    (clear b184)
    (on b184 b157)
    (on-table b157)
    (clear b360)
    (on b360 b278)
    (on b278 b213)
    (on-table b213)
    (clear b108)
    (on b108 b269)
    (on b269 b203)
    (on b203 b381)
    (on b381 b88)
    (on-table b88)
    (clear b178)
    (on b178 b365)
    (on b365 b127)
    (on-table b127)
    (clear b234)
    (on b234 b238)
    (on b238 b393)
    (on b393 b52)
    (on b52 b398)
    (on b398 b120)
    (on b120 b327)
    (on b327 b307)
    (on-table b307)
    (clear b66)
    (on b66 b146)
    (on b146 b205)
    (on b205 b202)
    (on-table b202)
    (clear b100)
    (on b100 b93)
    (on b93 b91)
    (on b91 b43)
    (on b43 b369)
    (on b369 b107)
    (on-table b107)
    (clear b95)
    (on b95 b9)
    (on b9 b78)
    (on-table b78)
    (clear b280)
    (on b280 b94)
    (on-table b94)
    (clear b79)
    (on b79 b182)
    (on-table b182)
    (clear b235)
    (on b235 b129)
    (on b129 b343)
    (on b343 b181)
    (on-table b181)
    (clear b39)
    (on b39 b42)
    (on-table b42)
    (clear b317)
    (on b317 b364)
    (on b364 b12)
    (on b12 b247)
    (on-table b247)
    (clear b41)
    (on b41 b201)
    (on b201 b153)
    (on b153 b14)
    (on-table b14)
    (clear b195)
    (on b195 b174)
    (on b174 b267)
    (on b267 b75)
    (on-table b75)
    (clear b293)
    (on b293 b249)
    (on b249 b18)
    (on-table b18)
    (clear b312)
    (on-table b312)
    (clear b272)
    (on b272 b183)
    (on b183 b142)
    (on b142 b331)
    (on b331 b399)
    (on b399 b320)
    (on-table b320)
    (clear b225)
    (on b225 b143)
    (on b143 b105)
    (on-table b105)
    (clear b344)
    (on-table b344)
    (clear b185)
    (on-table b185)
    (clear b253)
    (on b253 b394)
    (on b394 b20)
    (on b20 b60)
    (on b60 b180)
    (on-table b180)
    (clear b232)
    (on b232 b73)
    (on b73 b322)
    (on-table b322)
    (clear b334)
    (on b334 b176)
    (on b176 b283)
    (on b283 b275)
    (on b275 b71)
    (on b71 b314)
    (on b314 b112)
    (on-table b112)
    (clear b147)
    (on-table b147)
    (clear b151)
    (on b151 b237)
    (on-table b237)
    (clear b229)
    (on b229 b149)
    (on b149 b96)
    (on b96 b118)
    (on b118 b351)
    (on b351 b330)
    (on b330 b309)
    (on-table b309)
    (clear b53)
    (on-table b53)
    (clear b114)
    (on b114 b197)
    (on b197 b361)
    (on b361 b402)
    (on-table b402)
    (clear b230)
    (on-table b230)
    (clear b356)
    (on-table b356)
    (clear b1)
    (on b1 b207)
    (on b207 b396)
    (on b396 b285)
    (on-table b285)
    (clear b189)
    (on b189 b297)
    (on-table b297)
    (clear b255)
    (on b255 b382)
    (on b382 b227)
    (on b227 b257)
    (on b257 b139)
    (on b139 b348)
    (on-table b348)
    (clear b65)
    (on b65 b59)
    (on b59 b233)
    (on b233 b367)
    (on b367 b22)
    (on b22 b355)
    (on b355 b130)
    (on b130 b236)
    (on b236 b209)
    (on b209 b384)
    (on b384 b329)
    (on-table b329)
    (clear b64)
    (on b64 b349)
    (on b349 b37)
    (on-table b37)
    (clear b82)
    (on-table b82)
    (clear b243)
    (on b243 b77)
    (on b77 b166)
    (on b166 b110)
    (on b110 b40)
    (on b40 b252)
    (on b252 b134)
    (on-table b134)
    (clear b161)
    (on b161 b296)
    (on b296 b254)
    (on-table b254)
    (clear b98)
    (on b98 b102)
    (on b102 b44)
    (on b44 b175)
    (on b175 b81)
    (on b81 b49)
    (on-table b49)
    (clear b74)
    (on b74 b187)
    (on-table b187)
    (clear b145)
    (on b145 b122)
    (on-table b122)
    (clear b286)
    (on b286 b103)
    (on b103 b341)
    (on-table b341)
    (clear b366)
    (on b366 b401)
    (on b401 b400)
    (on b400 b328)
    (on b328 b33)
    (on-table b33)
    (clear b177)
    (on b177 b57)
    (on-table b57)
    (clear b359)
    (on b359 b128)
    (on-table b128)
    (clear b23)
    (on b23 b241)
    (on-table b241)
    (clear b333)
    (on b333 b294)
    (on b294 b204)
    (on b204 b87)
    (on-table b87)
    (clear b231)
    (on b231 b282)
    (on b282 b90)
    (on-table b90)
    (clear b163)
    (on-table b163)
    (clear b251)
    (on b251 b256)
    (on b256 b215)
    (on b215 b154)
    (on b154 b319)
    (on b319 b353)
    (on b353 b99)
    (on b99 b7)
    (on b7 b21)
    (on b21 b5)
    (on-table b5)
    (clear b116)
    (on b116 b226)
    (on b226 b261)
    (on b261 b295)
    (on b295 b376)
    (on b376 b4)
    (on b4 b388)
    (on b388 b370)
    (on b370 b67)
    (on-table b67)
    (clear b325)
    (on b325 b220)
    (on b220 b221)
    (on-table b221))
 (:goal  (and 
    (clear b2)
    (on b2 b7)
    (on b7 b12)
    (on b12 b3)
    (on-table b3)
    (clear b8)
    (on b8 b11)
    (on b11 b10)
    (on b10 b4)
    (on b4 b5)
    (on b5 b9)
    (on-table b9)
    (clear b6)
    (on b6 b1)
    (on-table b1))))

; plan
1. (unstack b1 b207)
   deleted: (on b1 b207) (clear b1) (arm-empty)
   added: (holding b1) (clear b207)
   goals met: 1 of 15
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 2 of 15
3. (unstack b116 b226)
   deleted: (on b116 b226) (clear b116) (arm-empty)
   added: (holding b116) (clear b226)
   goals met: 2 of 15
4. (putdown b116)
   deleted: (holding b116)
   added: (clear b116) (arm-empty) (on-table b116)
   goals met: 2 of 15
5. (unstack b123 b83)
   deleted: (on b123 b83) (clear b123) (arm-empty)
   added: (holding b123) (clear b83)
   goals met: 2 of 15
6. (putdown b123)
   deleted: (holding b123)
   added: (clear b123) (arm-empty) (on-table b123)
   goals met: 2 of 15
7. (unstack b144 b3)
   deleted: (on b144 b3) (clear b144) (arm-empty)
   added: (holding b144) (clear b3)
   goals met: 2 of 15
8. (putdown b144)
   deleted: (holding b144)
   added: (clear b144) (arm-empty) (on-table b144)
   goals met: 2 of 15
9. (unstack b3 b121)
   deleted: (on b3 b121) (clear b3) (arm-empty)
   added: (holding b3) (clear b121)
   goals met: 2 of 15
10. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 15
11. (unstack b152 b11)
   deleted: (on b152 b11) (clear b152) (arm-empty)
   added: (holding b152) (clear b11)
   goals met: 3 of 15
12. (putdown b152)
   deleted: (holding b152)
   added: (clear b152) (arm-empty) (on-table b152)
   goals met: 3 of 15
13. (unstack b191 b165)
   deleted: (on b191 b165) (clear b191) (arm-empty)
   added: (holding b191) (clear b165)
   goals met: 3 of 15
14. (putdown b191)
   deleted: (holding b191)
   added: (clear b191) (arm-empty) (on-table b191)
   goals met: 3 of 15
15. (unstack b165 b10)
   deleted: (on b165 b10) (clear b165) (arm-empty)
   added: (holding b165) (clear b10)
   goals met: 3 of 15
16. (putdown b165)
   deleted: (holding b165)
   added: (clear b165) (arm-empty) (on-table b165)
   goals met: 3 of 15
17. (unstack b226 b261)
   deleted: (on b226 b261) (clear b226) (arm-empty)
   added: (holding b226) (clear b261)
   goals met: 3 of 15
18. (putdown b226)
   deleted: (holding b226)
   added: (clear b226) (arm-empty) (on-table b226)
   goals met: 3 of 15
19. (unstack b250 b186)
   deleted: (on b250 b186) (clear b250) (arm-empty)
   added: (holding b250) (clear b186)
   goals met: 3 of 15
20. (putdown b250)
   deleted: (holding b250)
   added: (clear b250) (arm-empty) (on-table b250)
   goals met: 3 of 15
21. (unstack b186 b336)
   deleted: (on b186 b336) (clear b186) (arm-empty)
   added: (holding b186) (clear b336)
   goals met: 3 of 15
22. (putdown b186)
   deleted: (holding b186)
   added: (clear b186) (arm-empty) (on-table b186)
   goals met: 3 of 15
23. (unstack b251 b256)
   deleted: (on b251 b256) (clear b251) (arm-empty)
   added: (holding b251) (clear b256)
   goals met: 3 of 15
24. (putdown b251)
   deleted: (holding b251)
   added: (clear b251) (arm-empty) (on-table b251)
   goals met: 3 of 15
25. (unstack b256 b215)
   deleted: (on b256 b215) (clear b256) (arm-empty)
   added: (holding b256) (clear b215)
   goals met: 3 of 15
26. (putdown b256)
   deleted: (holding b256)
   added: (clear b256) (arm-empty) (on-table b256)
   goals met: 3 of 15
27. (unstack b215 b154)
   deleted: (on b215 b154) (clear b215) (arm-empty)
   added: (holding b215) (clear b154)
   goals met: 3 of 15
28. (putdown b215)
   deleted: (holding b215)
   added: (clear b215) (arm-empty) (on-table b215)
   goals met: 3 of 15
29. (unstack b154 b319)
   deleted: (on b154 b319) (clear b154) (arm-empty)
   added: (holding b154) (clear b319)
   goals met: 3 of 15
30. (putdown b154)
   deleted: (holding b154)
   added: (clear b154) (arm-empty) (on-table b154)
   goals met: 3 of 15
31. (unstack b261 b295)
   deleted: (on b261 b295) (clear b261) (arm-empty)
   added: (holding b261) (clear b295)
   goals met: 3 of 15
32. (putdown b261)
   deleted: (holding b261)
   added: (clear b261) (arm-empty) (on-table b261)
   goals met: 3 of 15
33. (unstack b295 b376)
   deleted: (on b295 b376) (clear b295) (arm-empty)
   added: (holding b295) (clear b376)
   goals met: 3 of 15
34. (putdown b295)
   deleted: (holding b295)
   added: (clear b295) (arm-empty) (on-table b295)
   goals met: 3 of 15
35. (unstack b317 b364)
   deleted: (on b317 b364) (clear b317) (arm-empty)
   added: (holding b317) (clear b364)
   goals met: 3 of 15
36. (putdown b317)
   deleted: (holding b317)
   added: (clear b317) (arm-empty) (on-table b317)
   goals met: 3 of 15
37. (unstack b319 b353)
   deleted: (on b319 b353) (clear b319) (arm-empty)
   added: (holding b319) (clear b353)
   goals met: 3 of 15
38. (putdown b319)
   deleted: (holding b319)
   added: (clear b319) (arm-empty) (on-table b319)
   goals met: 3 of 15
39. (unstack b336 b265)
   deleted: (on b336 b265) (clear b336) (arm-empty)
   added: (holding b336) (clear b265)
   goals met: 3 of 15
40. (putdown b336)
   deleted: (holding b336)
   added: (clear b336) (arm-empty) (on-table b336)
   goals met: 3 of 15
41. (unstack b265 b347)
   deleted: (on b265 b347) (clear b265) (arm-empty)
   added: (holding b265) (clear b347)
   goals met: 3 of 15
42. (putdown b265)
   deleted: (holding b265)
   added: (clear b265) (arm-empty) (on-table b265)
   goals met: 3 of 15
43. (unstack b347 b345)
   deleted: (on b347 b345) (clear b347) (arm-empty)
   added: (holding b347) (clear b345)
   goals met: 3 of 15
44. (putdown b347)
   deleted: (holding b347)
   added: (clear b347) (arm-empty) (on-table b347)
   goals met: 3 of 15
45. (unstack b345 b6)
   deleted: (on b345 b6) (clear b345) (arm-empty)
   added: (holding b345) (clear b6)
   goals met: 4 of 15
46. (putdown b345)
   deleted: (holding b345)
   added: (clear b345) (arm-empty) (on-table b345)
   goals met: 4 of 15
47. (unstack b353 b99)
   deleted: (on b353 b99) (clear b353) (arm-empty)
   added: (holding b353) (clear b99)
   goals met: 4 of 15
48. (putdown b353)
   deleted: (holding b353)
   added: (clear b353) (arm-empty) (on-table b353)
   goals met: 4 of 15
49. (unstack b364 b12)
   deleted: (on b364 b12) (clear b364) (arm-empty)
   added: (holding b364) (clear b12)
   goals met: 4 of 15
50. (putdown b364)
   deleted: (holding b364)
   added: (clear b364) (arm-empty) (on-table b364)
   goals met: 4 of 15
51. (unstack b376 b4)
   deleted: (on b376 b4) (clear b376) (arm-empty)
   added: (holding b376) (clear b4)
   goals met: 4 of 15
52. (putdown b376)
   deleted: (holding b376)
   added: (clear b376) (arm-empty) (on-table b376)
   goals met: 4 of 15
53. (unstack b83 b228)
   deleted: (on b83 b228) (clear b83) (arm-empty)
   added: (holding b83) (clear b228)
   goals met: 4 of 15
54. (putdown b83)
   deleted: (holding b83)
   added: (clear b83) (arm-empty) (on-table b83)
   goals met: 4 of 15
55. (unstack b228 b172)
   deleted: (on b228 b172) (clear b228) (arm-empty)
   added: (holding b228) (clear b172)
   goals met: 4 of 15
56. (putdown b228)
   deleted: (holding b228)
   added: (clear b228) (arm-empty) (on-table b228)
   goals met: 4 of 15
57. (unstack b172 b271)
   deleted: (on b172 b271) (clear b172) (arm-empty)
   added: (holding b172) (clear b271)
   goals met: 4 of 15
58. (putdown b172)
   deleted: (holding b172)
   added: (clear b172) (arm-empty) (on-table b172)
   goals met: 4 of 15
59. (unstack b271 b321)
   deleted: (on b271 b321) (clear b271) (arm-empty)
   added: (holding b271) (clear b321)
   goals met: 4 of 15
60. (putdown b271)
   deleted: (holding b271)
   added: (clear b271) (arm-empty) (on-table b271)
   goals met: 4 of 15
61. (unstack b321 b313)
   deleted: (on b321 b313) (clear b321) (arm-empty)
   added: (holding b321) (clear b313)
   goals met: 4 of 15
62. (putdown b321)
   deleted: (holding b321)
   added: (clear b321) (arm-empty) (on-table b321)
   goals met: 4 of 15
63. (unstack b313 b2)
   deleted: (on b313 b2) (clear b313) (arm-empty)
   added: (holding b313) (clear b2)
   goals met: 5 of 15
64. (putdown b313)
   deleted: (holding b313)
   added: (clear b313) (arm-empty) (on-table b313)
   goals met: 5 of 15
65. (unstack b95 b9)
   deleted: (on b95 b9) (clear b95) (arm-empty)
   added: (holding b95) (clear b9)
   goals met: 5 of 15
66. (putdown b95)
   deleted: (holding b95)
   added: (clear b95) (arm-empty) (on-table b95)
   goals met: 5 of 15
67. (unstack b9 b78)
   deleted: (on b9 b78) (clear b9) (arm-empty)
   added: (holding b9) (clear b78)
   goals met: 5 of 15
68. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 6 of 15
69. (unstack b99 b7)
   deleted: (on b99 b7) (clear b99) (arm-empty)
   added: (holding b99) (clear b7)
   goals met: 6 of 15
70. (putdown b99)
   deleted: (holding b99)
   added: (clear b99) (arm-empty) (on-table b99)
   goals met: 6 of 15
71. (unstack b10 b45)
   deleted: (on b10 b45) (clear b10) (arm-empty)
   added: (holding b10) (clear b45)
   goals met: 6 of 15
72. (stack b10 b4)
   deleted: (clear b4) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b4)
   goals met: 7 of 15
73. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 7 of 15
74. (stack b11 b10)
   deleted: (clear b10) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b10)
   goals met: 8 of 15
75. (unstack b12 b247)
   deleted: (on b12 b247) (clear b12) (arm-empty)
   added: (holding b12) (clear b247)
   goals met: 8 of 15
76. (stack b12 b3)
   deleted: (clear b3) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b3)
   goals met: 9 of 15
77. (unstack b7 b21)
   deleted: (on b7 b21) (clear b7) (arm-empty)
   added: (holding b7) (clear b21)
   goals met: 9 of 15
78. (stack b7 b12)
   deleted: (clear b12) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b12)
   goals met: 10 of 15
79. (unstack b21 b5)
   deleted: (on b21 b5) (clear b21) (arm-empty)
   added: (holding b21) (clear b5)
   goals met: 10 of 15
80. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 10 of 15
81. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 10 of 15
82. (stack b5 b9)
   deleted: (clear b9) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b9)
   goals met: 11 of 15
83. (unstack b2 b113)
   deleted: (on b2 b113) (clear b2) (arm-empty)
   added: (holding b2) (clear b113)
   goals met: 10 of 15
84. (stack b2 b7)
   deleted: (clear b7) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b7)
   goals met: 12 of 15
85. (unstack b6 b277)
   deleted: (on b6 b277) (clear b6) (arm-empty)
   added: (holding b6) (clear b277)
   goals met: 11 of 15
86. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 13 of 15
87. (unstack b11 b10)
   deleted: (on b11 b10) (clear b11) (arm-empty)
   added: (holding b11) (clear b10)
   goals met: 12 of 15
88. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 12 of 15
89. (unstack b10 b4)
   deleted: (on b10 b4) (clear b10) (arm-empty)
   added: (holding b10) (clear b4)
   goals met: 11 of 15
90. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 11 of 15
91. (unstack b4 b388)
   deleted: (on b4 b388) (clear b4) (arm-empty)
   added: (holding b4) (clear b388)
   goals met: 11 of 15
92. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 12 of 15
93. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 12 of 15
94. (stack b10 b4)
   deleted: (clear b4) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b4)
   goals met: 13 of 15
95. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 13 of 15
96. (stack b11 b10)
   deleted: (clear b10) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b10)
   goals met: 14 of 15
97. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 13 of 15
98. (stack b8 b11)
   deleted: (clear b11) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b11)
   goals met: 15 of 15
